package InterfaceTest;

public class Comment {
//	참조 : https://limkydev.tistory.com/197
//	JAVA8 이전까지는 상수, 추상메소드만 선언이 가능하지만,
//	JAVA8부터 디폴트메소드, 정적메소드가 추가되었다.
//	디폴트메소드, 정적메소드를 통해, 구현 강제성 안에 유연함을 심었다고 우선 이해하자

//	상수 : 인터페이스에서 값을 정해줄테니 함부로 바꾸지 말고 제공해주는 값만 참조해라 (절대적)

//	추상메소드 : 가이드만 줄테니 추상메소드를 오버라이팅해서 재구현해라. (강제적)

//	디폴트메소드 : 인터페이스에서 기본적으로 제공해주지만, 맘에 안들면 각자 구현해서 써라. (선택적)

//	정적메소드 : 인터페이스에서 제공해주는 것으로 무조건 사용 (절대적)

// 	추상메소드를 인터페이스에 추가한다면 이를 implements한 모든클래스에서 추상메소드를
// 	구현하지 않는다면 에러가 나는데 디폴트메소드로 정의한다면 기본 구현부가 마음에 들지 않을 시
//	각자가 오버라이딩을 하여 선택적인 메소드 가이드 가능
}
